#    -*- mode: org -*-


Archived entries from file /home/n/.emacs.d/lisp/doct/notes.org
***** rough sketch
#+name: properties
#+begin_src emacs-lisp
'(:doct-keys "xp" :contexts ((:unless-file "one.org")
                             (:in-file ("one.org" "two.org") :keys "xp")))
#+end_src

#+RESULTS: properties
| :doct-keys | xp | :contexts | ((:unless-file one.org) (:in-buffer (one.org two.org) :keys xp)) |


#+begin_src emacs-lisp :var properties=properties :results replace scalar
(defvar doct-context-keywords '(:in-buffer
                                :in-file
                                :in-mode
                                :unless-buffer
                                :unless-file
                                :unless-mode
                                :function))

(pp
 (doct--add-contexts properties))
#+end_src

#+RESULTS:
#+begin_example
"((\"xp\"
  ((not-in-file . \"one.org\")))
 (\"xp\" \"xp\"
  (#'(lambda nil
       (seq-some
        (lambda
          (val)
          (string-match val
                        (or
                         (buffer-file-name)
                         \"\")))
        '(\"one.org\" \"two.org\"))))))
"
#+end_example

#+begin_src emacs-lisp
(setq org-capture-templates-contexts '(("n" ((lambda () (not (member major-mode '(org-mode elisp-mode wikinforg))))))))
#+end_src
